Revit 2027 API
PointCloudOverrideSettings(PointCloudOverrideSettings) Constructor
 Constructs a copy of source object.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudOverrideSettings(
	PointCloudOverrideSettings other
)
Public Sub New (
	other As PointCloudOverrideSettings
)
public:
PointCloudOverrideSettings(
	PointCloudOverrideSettings^ other
)
new :
        other : PointCloudOverrideSettings -> PointCloudOverrideSettings
Parameters
other PointCloudOverrideSettings
 Source object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrideSettings Class
PointCloudOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace